[{"comment":"He is great  but be ready for hard exams and u can easily use ur phone or chat gpt in his exam since he doesnt walk on the exam hall try to attend his lectures and his group projects are easy but he grades tough so attend his lecture","class_name":"CS322","date":"2023-12-26 23:07:00 +0000 UTC","rating_tags":"Tough grader--Group projects--Test heavy","difficulty":3.0,"grade":"C","would_take_again":false},{"comment":"This class can get confusing at times, so just make sure you're constantly revising the concepts he goes over. Attend lectures because he will let you know what will be on his exams. Lectures might be a little hard to understand sometimes, so recommend going to his office hours for clarification. Make sure to get started on the group project early!","class_name":"CSC322","date":"2022-12-31 00:27:13 +0000 UTC","rating_tags":"Tough grader--Group projects--Lecture heavy","difficulty":4.0,"grade":"B","would_take_again":true},{"comment":"He's a good professor but if anyone cannot finish their exam on time, you will get in big trouble. He is strict about people finishing their exams on time. However, the lectures that he gives in the class demonstrate about the real world of Computer Engineers if they work in Silicon Valley as well as the environment  and duties over there. ","class_name":"CSC322","date":"2022-06-11 15:26:17 +0000 UTC","rating_tags":"Tough grader--Group projects--Inspirational","difficulty":3.0,"grade":"B-","would_take_again":false},{"comment":"He can get messy at times with the class notes but if you manage to get good notes, and start the project on time, this class is easy. Also, he basically tells you what will be on the exam so you can just focus on that. As a bonus, he is so funny as a result class was not boring at all.","class_name":"CS322","date":"2021-05-31 02:01:17 +0000 UTC","rating_tags":"Gives good feedback--Respected--Group projects","difficulty":2.0,"grade":"A+","would_take_again":true},{"comment":"Not as bad as he seems. The exams are based on your understanding of the lectures and your knowledge of algorithms and solving coding problems. The algorithm questions are mostly based on your knowledge. My advice: be on time for lectures, take the best notes you can, don't rewatch lectures (time-consuming), and start early on the group project.","class_name":"CSC322","date":"2020-12-25 21:31:57 +0000 UTC","rating_tags":"Gives good feedback--Skip class? You won't pass.--Lecture heavy","difficulty":3.0,"grade":"A","would_take_again":true},{"comment":"Prof Wei is a very knowledgeable guy. You will definitely learn from him; however, you need to put in the time to understand all the diagrams presented in the course. The group project can be absolutely brutal; however, it is still doable. Knowing someone in the class helps for that. My only complaint is that he can get very messy when writing.","class_name":"CSC322","date":"2020-12-23 17:55:13 +0000 UTC","rating_tags":"Accessible outside class--Group projects--Caring","difficulty":3.0,"grade":"A+","would_take_again":true},{"comment":"truly a gem. He kept the class lively and laughin so i didnt lose focus. He knows which chat is directed at him so he respond asap. felt like learning from a twitch streamer lol. he's a good guy.","class_name":"CSC322","date":"2020-12-23 15:58:19 +0000 UTC","rating_tags":"N/A","difficulty":2.0,"grade":"A","would_take_again":true},{"comment":"Terrible accent, goes all over the place, terrible teaching. You know, just another usual CCNY Prof who teaches high level classes where you will be wasting your time and money.","class_name":"CSC322","date":"2020-10-15 18:50:14 +0000 UTC","rating_tags":"Get ready to read--Graded by few things--Tough grader","difficulty":3.0,"grade":"B","would_take_again":true},{"comment":"Lectures vague, not clear and confusing. No solid structure. He uses &quot;Paint&quot;. You will have to self study alot. Project work is heavy.","class_name":"CS322","date":"2020-05-04 18:46:15 +0000 UTC","rating_tags":"Lots of homework","difficulty":4.0,"grade":"Not sure yet","would_take_again":true},{"comment":"Professor Wei seems to know his stuff and is a very avid lecturer. However, his teaching seems to be all over the place and a bit redundant since he writes in ms paint. Beware, there is no material provided from what he covers in class so good luck. Make sure you do your best in trying to understand. You will need to self study a lot.","class_name":"CS322","date":"2020-04-14 20:46:08 +0000 UTC","rating_tags":"Get ready to read--Skip class? You won't pass.--Lecture heavy","difficulty":3.0,"grade":"Not sure yet","would_take_again":true},{"comment":"You gotta go in to class to get notes, but half the times, the notes will be all over the place so do try your best to understand. On exams there will be diagrams, algorithm and conceptual questions. Project is graded leniently and exams graded harshly. He also draws huge diagrams with paint using a mouse so good luck taking notes.","class_name":"CS322","date":"2019-12-29 18:12:16 +0000 UTC","rating_tags":"Skip class? You won't pass.--Graded by few things--Lecture heavy","difficulty":4.0,"grade":"B","would_take_again":true},{"comment":"Prof. Wei is a very intelligent person. He knows his stuff. English is not his first language. His presentation and lecture skills could be much improved. Talks fast You must go to lecture to understand the material, as his slides are a group of chunks of words. Exams are very difficult, but there is a curve. Final project is difficult but doable.","class_name":"CS322","date":"2019-11-16 18:10:41 +0000 UTC","rating_tags":"Hilarious--Lecture heavy--Tough grader","difficulty":4.0,"grade":"Not sure yet","would_take_again":true},{"comment":"Notes he provides are hard to decipher. First quiz contained algorithm questions that were never taught in my algorithm class. Midterm contained diagram questions that he clearly did not teach fully. Assigns an overly complicated final group project that he does not prepare you for. But, I guess you have no choice but to take him for 322.","class_name":"CSC322","date":"2019-11-11 16:02:35 +0000 UTC","rating_tags":"Skip class? You won't pass.--Test heavy--Tough grader","difficulty":5.0,"grade":"Not Available","would_take_again":true},{"comment":"Very good lectures. You understand the material if you follow through.","class_name":"CSCII100","date":"2017-12-06 00:15:27 +0000 UTC","rating_tags":"Gives good feedback--Clear grading criteria--Would take again","difficulty":3.0,"grade":"A","would_take_again":true},{"comment":"Very interesting course. Teaches the subject very well and makes the class fun. Going to class and taking notes will help you a lot for the quiz,midterm,and final. Find a good group (great programmers) and start it as early as you can. Lab quiz will be based on the handouts from your lab TA.","class_name":"CS322","date":"2016-12-16 21:20:07 +0000 UTC","rating_tags":"Clear grading criteria--Amazing lectures--GROUP PROJECTS","difficulty":3.0,"grade":"Not Available","would_take_again":true},{"comment":"Great lecturer! His teaching style caters to all learning styles; definitely one of my favorites in the dept. Material was interesting and the class was enjoyable and entertaining at times. Hard exams but lectures are preparation enough. Definitely one of the better classes in the grad program.","class_name":"CSCII100","date":"2011-12-20 22:22:25 +0000 UTC","rating_tags":"N/A","difficulty":4.0,"grade":"Not Available","would_take_again":false},{"comment":"Absolutely loved the class. Very interesting class. Accent will take some time to get used to. But after that you will really enjoy his sense of humor. Loved the assigments, it was very helpful to understand the topics taught in class. Very very helpful and you get quick responses to your mails.","class_name":"CSC1000","date":"2010-12-13 00:43:20 +0000 UTC","rating_tags":"N/A","difficulty":4.0,"grade":"Not Available","would_take_again":false},{"comment":"The project is killer.  The exams are crazy.  But his accent is the only thing to complain about.  Other than that, pretty good professor.","class_name":"CSC322","date":"2010-08-28 01:12:21 +0000 UTC","rating_tags":"N/A","difficulty":3.0,"grade":"Not Available","would_take_again":false},{"comment":"You can't avoid taking him.  He's not exactly the best prof, he's ok. Be ready to take quick notes as he only write on one area of the board.  He does expect a lot from the project, he curves the grade.  The &quot;lab&quot; is useless, so don't even bother going.","class_name":"CS322","date":"2007-12-28 13:41:15 +0000 UTC","rating_tags":"N/A","difficulty":3.0,"grade":"Not Available","would_take_again":false},{"comment":"Try to avoid his class. Not a helpful at all.","class_name":"CSC322","date":"2007-02-03 22:47:44 +0000 UTC","rating_tags":"N/A","difficulty":5.0,"grade":"Not Available","would_take_again":false},{"comment":"Nice professor but expect to do some work especially on the project.  Try to start your project early and take notes in class.  You should learn a lot from the class.","class_name":"CSC322","date":"2007-01-11 12:02:45 +0000 UTC","rating_tags":"N/A","difficulty":2.0,"grade":"Not Available","would_take_again":false},{"comment":"nice professor, you will learn!!!!!","class_name":"CSC322","date":"2006-12-20 19:05:22 +0000 UTC","rating_tags":"N/A","difficulty":3.0,"grade":"Not Available","would_take_again":false},{"comment":"He repeats his projects, so just get it from someone from a previous semester and you're all set. His class was mad easy.","class_name":"CS322","date":"2006-08-10 23:08:01 +0000 UTC","rating_tags":"N/A","difficulty":1.0,"grade":"Not Available","would_take_again":false},{"comment":"No Comments","class_name":"DIGITALLIBRARI","date":"2006-05-31 12:49:38 +0000 UTC","rating_tags":"N/A","difficulty":2.0,"grade":"Not Available","would_take_again":false},{"comment":"Very good at explaining the material and making a productive learning environment. Tells a good amount of jokes in class, which again livens the atmosphere. Very long Spec and Design docs and both only 3% of your grade, but teaches you the stuff you need to know for the entry level programming job. One of the best professors at CCNY!","class_name":"CSC322","date":"2006-04-11 09:03:17 +0000 UTC","rating_tags":"N/A","difficulty":4.0,"grade":"Not Available","would_take_again":false},{"comment":"He is a nice instructor but he english needs work. Sometimes when he talks it sounds like he is speaking chinese :( He is fair and helpful but it hard to understand him. I feel a bit bad writing this. Sorry Prof. Wei.","class_name":"CSC322336","date":"2006-02-25 17:48:03 +0000 UTC","rating_tags":"N/A","difficulty":2.0,"grade":"Not Available","would_take_again":false},{"comment":"excellent professor..","class_name":"SOFTWAREENGR","date":"2005-11-20 13:54:40 +0000 UTC","rating_tags":"N/A","difficulty":3.0,"grade":"Not Available","would_take_again":false},{"comment":"clear, helpful, and interrested in the class, nice project but hard","class_name":"CSC336","date":"2005-11-07 17:09:55 +0000 UTC","rating_tags":"N/A","difficulty":1.0,"grade":"Not Available","would_take_again":false},{"comment":"this guy is a dick and I mean it.","class_name":"322","date":"2004-12-23 00:57:15 +0000 UTC","rating_tags":"N/A","difficulty":5.0,"grade":"Not Available","would_take_again":false},{"comment":"This Prof. writes all over the board and right above his own writing! Making it difficult to follow  his notes. So pay attention to what he says in class.Also beware of his voice volume control. He tends to speak very loudly at times (waking you from your nap).","class_name":"322","date":"2004-12-19 04:23:48 +0000 UTC","rating_tags":"N/A","difficulty":2.0,"grade":"Not Available","would_take_again":false},{"comment":"I took software engineering with him. Wei is tough, challenging, but he is nice when it comes to grading. He is funny too, so the class is not boring.","class_name":"CSC322","date":"2004-12-14 16:27:12 +0000 UTC","rating_tags":"N/A","difficulty":3.0,"grade":"Not Available","would_take_again":false},{"comment":"No Comments","class_name":"CSC322","date":"2004-02-18 04:13:46 +0000 UTC","rating_tags":"N/A","difficulty":3.0,"grade":"Not Available","would_take_again":false}]